Reports/лб_ОтчетДляВоенкомата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>лб_ОтчетДляВоенкомата</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/бит_ВоинскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ВоинскийУчет</Name>
			<Comment>(Бит)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтношениеКВоинскойОбязанности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ОтношениеКВоинскойОбязанности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтношениеКВоинскомуУчету</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ОтношениеКВоинскомуУчету</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияЗапаса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_КатегорииЗапасаВоеннообязанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Звание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЗваниеГражданскогоВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СоставыВоеннослужащих</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВУС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Годность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ГодностьКВоеннойСлужбе</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Военкомат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Военкоматы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеМобпредписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКомандыПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ОтношениеКВоинскойОбязанности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ОтношениеКВоинскойОбязанности</Name>
			<Comment>(Бит)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Военнообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВоеннообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Призывник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/лб_ОтчетДляВоенкомата/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьУчастки();
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	НачДата = Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy");
	КонДата = Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
	Если ЗначениеЗаполнено(ДатаРождения) Тогда
		нДатаРождения = Формат(ДатаРождения.ДатаНачала, "ДФ=dd.MM.yyyy");
		кДатаРождения = Формат(ДатаРождения.ДатаОкончания, "ДФ=dd.MM.yyyy");	
	КонецЕсли; 
	
	Макет = ТекОбъект.ПолучитьМакет("Макет");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Если Военнообязанные Тогда
		ОбластьЗаголовок.Параметры.ЗаголовокОтчета = ТипОтчета;
	Иначе
		ОбластьЗаголовок.Параметры.ЗаголовокОтчета = СтрЗаменить(ТипОтчета, "Военнообязанные", "Проживающие");
	КонецЕсли; 	
	
	ОбластьЗаголовок.Параметры.ДатаНачала = НачДата; 
	ОбластьЗаголовок.Параметры.ДатаОкончания = КонДата; 
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	Если ТипОтчета = "Военнообязанные, зарегистрированные по месту жительства" И НЕ ВыводитьПаспортныеДанные Тогда
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаПоМестуЖительства");
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПоМестуЖительства");
	ИначеЕсли ТипОтчета = "Военнообязанные, зарегистрированные по месту жительства" И ВыводитьПаспортныеДанные Тогда
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаПоМестуЖительстваПаспорт");
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПоМестуЖительстваПаспорт");
	ИначеЕсли ТипОтчета = "Военнообязанные, зарегистрированные по месту пребывания" И НЕ ВыводитьПаспортныеДанные Тогда
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаПоМестуПребывания");
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПоМестуПребывания");	
	ИначеЕсли ТипОтчета = "Военнообязанные, зарегистрированные по месту пребывания" И ВыводитьПаспортныеДанные Тогда
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаПоМестуПребыванияПаспорт");
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПоМестуПребыванияПаспорт");
	ИначеЕсли ТипОтчета = "Военнообязанные, снятые с регистрационного учета" И НЕ ВыводитьПаспортныеДанные Тогда
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаСнятыеСУчета");
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаСнятыеСУчета");	
	ИначеЕсли ТипОтчета = "Военнообязанные, снятые с регистрационного учета" И ВыводитьПаспортныеДанные Тогда	
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаСнятыеСУчетаПаспорт");
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаСнятыеСУчетаПаспорт");	
	КонецЕсли; 
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	ДанныеДляЗаполнения = ПолучитьДанныеДляЗаполненияНаСервере();
	НомерСтроки = 1;
	
	Если Военнообязанные Тогда
		
		Для каждого Стр Из ДанныеДляЗаполнения Цикл
			
			нВоеннообязанный = ПроверитьВоеннообязанный(Стр.ФИО);
			
			Если нВоеннообязанный Тогда
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Стр);
				
				Попытка
					ОбластьСтрока.Параметры.ДатаРождения = Формат(Стр.ДатаРождения, "ДЛФ=Д");	
				Исключение
					//ОписаниеОшибки()
				КонецПопытки; 
				Попытка
					ОбластьСтрока.Параметры.ДатаРегистрации = Формат(Стр.ДатаРегистрации, "ДЛФ=Д");
				Исключение
					//ОписаниеОшибки()
				КонецПопытки;
				
				Если ВыводитьПаспортныеДанные Тогда
					ТекстПаспорт = "Паспорт: Выдан " + Стр.ДокументКемВыдан + " " + стр.ДокументКодПодразделения + " от " + Формат(стр.ДокументДатаВыдачи, "ДЛФ=Д") + " серия "  + стр.ДокументСерия + " номер " + стр.ДокументНомер;
					ОбластьСтрока.Параметры.ПаспортныеДанные = ТекстПаспорт;
				КонецЕсли; 
				
				АдресПроживания = Стр.ЛицевойСчет.Здание.ПочтовыйАдрес + ?(ЗначениеЗаполнено(Стр.ЛицевойСчет.Квартира), ", кв." + Строка(Стр.ЛицевойСчет.Квартира),"");
				ОбластьСтрока.Параметры.АдресПроживания = АдресПроживания;
				
				ОбластьСтрока.Параметры.НомерПункта = НомерСтроки;
				НомерСтроки = НомерСтроки + 1;
				
				ТабДокумент.Вывести(ОбластьСтрока);
				
			КонецЕсли; 
			
		КонецЦикла; 	
		
	Иначе
		
		Для каждого Стр Из ДанныеДляЗаполнения Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Стр);
			
			Попытка
				ОбластьСтрока.Параметры.ДатаРождения = Формат(Стр.ДатаРождения, "ДЛФ=Д");	
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			Попытка
				ОбластьСтрока.Параметры.ДатаРегистрации = Формат(Стр.ДатаРегистрации, "ДЛФ=Д");
			Исключение
				//ОписаниеОшибки()
			КонецПопытки;
			
			
			Если ВыводитьПаспортныеДанные Тогда
				ТекстПаспорт = "Паспорт: Выдан " + Стр.ДокументКемВыдан + " " + стр.ДокументКодПодразделения + " от " + Формат(стр.ДокументДатаВыдачи, "ДЛФ=Д") + " серия "  + стр.ДокументСерия + " номер " + стр.ДокументНомер;
				ОбластьСтрока.Параметры.ПаспортныеДанные = ТекстПаспорт;
			КонецЕсли; 
			
			АдресПроживания = Стр.ЛицевойСчет.Здание.ПочтовыйАдрес + ?(ЗначениеЗаполнено(Стр.ЛицевойСчет.Квартира), ", кв." + Строка(Стр.ЛицевойСчет.Квартира),"");
			ОбластьСтрока.Параметры.АдресПроживания = АдресПроживания;
			
			ОбластьСтрока.Параметры.НомерПункта = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
			
			ТабДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	//ТабДокумент.Вывести(ОбластьПодвал);
	
	//Пока ТабДокумент.ПроверитьВывод(ОбластьПодвал) Цикл
	ТабДокумент.Вывести(ОбластьПустаяСтрока); 
	//КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьПодвал); 
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область(4, ,4);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
Функция ПроверитьВоеннообязанный(Проживающий)
	
	ЗапросВоеннообязанный = Новый Запрос;
	ЗапросВоеннообязанный.УстановитьПараметр("ФизЛицо", Проживающий);
	ЗапросВоеннообязанный.УстановитьПараметр("Момент", КонецДня(Период.ДатаОкончания));
	
	ЗапросВоеннообязанный.Текст = "ВЫБРАТЬ
	|	бит_ВоинскийУчетСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности КАК ОтношениеКВоинскойОбязанности
	|ИЗ
	|	РегистрСведений.бит_ВоинскийУчет.СрезПоследних(&Момент, ФизЛицо  = &ФизЛицо) КАК бит_ВоинскийУчетСрезПоследних";
	
	ВыборкаВоеннообязанный = ЗапросВоеннообязанный.Выполнить().Выбрать();
	
	Если ВыборкаВоеннообязанный.Количество() > 0 Тогда
		
		ВыборкаВоеннообязанный.Следующий();
		
		Если ВыборкаВоеннообязанный.ОтношениеКВоинскойОбязанности = Перечисления.бит_ОтношениеКВоинскойОбязанности.НеВоеннообязанный Тогда
			Возврат Ложь;
		Иначе			
			Возврат Истина;
		КонецЕсли; 
		
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляЗаполненияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент", ТекущаяДата());
	//Запрос.УстановитьПараметр("ЛицевойСчет", Справочники.бит_ЛицевыеСчета.ПолучитьСсылку(Новый УникальныйИдентификатор("ceaf245c-1d93-11e9-ba8d-ac1f6b0f1d47")));//76141061835 (Справочник.бит_ЛицевыеСчета)
	Запрос.УстановитьПараметр("ДокументВид", Справочники.бит_ДокументыУдостоверяющиеЛичность.ПолучитьСсылку(Новый УникальныйИдентификатор("d0e846ea-daa6-11e9-ba98-ac1f6b0f1d47")));//Паспорт РФ  (Справочник.бит_ДокументыУдостоверяющиеЛичность)
	
	Если ТипОтчета = "Военнообязанные, зарегистрированные по месту жительства" Тогда		
		ПараметрТипОтчета = Новый СписокЗначений;
		ПараметрТипОтчета.Добавить(Справочники.бит_СтатусФизЛица.ПостояннаяРегистрация);
		Запрос.УстановитьПараметр("СтатусФизЛица", ПараметрТипОтчета);
		
		ЗапросДатаРегистрации = "
		|	И ПроживающиеПоЛССрезПоследних.лб_ДатаРегистрацииДляФЛС МЕЖДУ &нДатаРегистрации И &кДатаРегистрации";
		
		Запрос.УстановитьПараметр("нДатаРегистрации", Период.ДатаНачала);
		Запрос.УстановитьПараметр("кДатаРегистрации", Период.ДатаОкончания);
		
	ИначеЕсли ТипОтчета = "Военнообязанные, зарегистрированные по месту пребывания" Тогда
		ПараметрТипОтчета = Новый СписокЗначений;
		ПараметрТипОтчета.Добавить(Справочники.бит_СтатусФизЛица.ВременнаяРегистрация);
		Запрос.УстановитьПараметр("СтатусФизЛица", ПараметрТипОтчета);
		
		ЗапросДатаРегистрации = "
		|	И ПроживающиеПоЛССрезПоследних.лб_ДатаРегистрацииДляФЛС МЕЖДУ &нДатаРегистрации И &кДатаРегистрации";
		
		Запрос.УстановитьПараметр("нДатаРегистрации", Период.ДатаНачала);
		Запрос.УстановитьПараметр("кДатаРегистрации", Период.ДатаОкончания);
		
	ИначеЕсли ТипОтчета = "Военнообязанные, снятые с регистрационного учета" Тогда
		ПараметрТипОтчета = Новый СписокЗначений;
		ПараметрТипОтчета.Добавить(Справочники.бит_СтатусФизЛица.Выписан);
		ПараметрТипОтчета.Добавить(Справочники.бит_СтатусФизЛица.ПолучитьСсылку(Новый УникальныйИдентификатор("57d2081b-66eb-11ec-bac1-ac1f6b0f1d47")));// Окончание времен.рег. (Справочник.бит_СтатусФизЛица)
		ПараметрТипОтчета.Добавить(Справочники.бит_СтатусФизЛица.ПолучитьСсылку(Новый УникальныйИдентификатор("23ea2e17-191c-11e9-ba8d-ac1f6b0f1d47")));// Ответственный не проживает (Справочник.бит_СтатусФизЛица)

		Запрос.УстановитьПараметр("СтатусФизЛица", ПараметрТипОтчета);			
		
		//ЗапросДатаРегистрации = "
		//|	И ПроживающиеПоЛССрезПоследних.лб_ДатаВыпискиДляФЛС МЕЖДУ &нДатаРегистрации И &кДатаРегистрации";
		//
		//Запрос.УстановитьПараметр("нДатаРегистрации", Период.ДатаНачала);
		//Запрос.УстановитьПараметр("кДатаРегистрации", Период.ДатаОкончания);
		//
		ЗапросДатаРегистрации = "
		|	";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаРождения) Тогда
		
		нДатаРождения = ДатаРождения.ДатаНачала;
		кДатаРождения = ДатаРождения.ДатаОкончания;
		
		ЗапросДатаРождения = "
		|	И ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения МЕЖДУ &нДатаРождения И &кДатаРождения";
		
		Запрос.УстановитьПараметр("нДатаРождения", нДатаРождения);
		Запрос.УстановитьПараметр("кДатаРождения", кДатаРождения);
	Иначе
		ЗапросДатаРождения = "";
	КонецЕсли; 
	
	Если Мужчины И Женщины Тогда	
		
		ПараметрПол = Новый СписокЗначений;
		ПараметрПол.Добавить(Перечисления.ПолФизическогоЛица.Мужской);
		ПараметрПол.Добавить(Перечисления.ПолФизическогоЛица.Женский);
		Запрос.УстановитьПараметр("Пол", ПараметрПол);
		
		ЗапросПолОбщий = " 	
		|	И ПроживающиеПоЛССрезПоследних.ФизЛицо.Пол В (&Пол)";
		
		ЗапросПолМужчины = "";
		ЗапросПолЖенщины = "";
		
		
		Если Военнообязанные Тогда
			ЗапросВоеннообязанные = "
			|И ВЫБОР
			|			КОГДА ПроживающиеПоЛССрезПоследних.ФизЛицо.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский)
			|				ТОГДА РАЗНОСТЬДАТ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения, &Момент, ГОД) - ВЫБОР
			|						КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > МЕСЯЦ(&Момент)
			|							ТОГДА 1
			|						КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) = МЕСЯЦ(&Момент)
			|								И ДЕНЬ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > ДЕНЬ(&Момент)
			|							ТОГДА 1
			|						ИНАЧЕ 0
			|					КОНЕЦ Между 15 И 51
			|			ИНАЧЕ РАЗНОСТЬДАТ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения, &Момент, ГОД) - ВЫБОР
			|					КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > МЕСЯЦ(&Момент)
			|						ТОГДА 1
			|					КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) = МЕСЯЦ(&Момент)
			|							И ДЕНЬ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > ДЕНЬ(&Момент)
			|						ТОГДА 1
			|					ИНАЧЕ 0
			|				КОНЕЦ Между 15 И 56
			|		КОНЕЦ";
			
			Запрос.УстановитьПараметр("Момент", ТекущаяДата());
		Иначе
			ЗапросВоеннообязанные = "";
		КонецЕсли; 
		
		
	ИначеЕсли Мужчины Тогда
		
		ПараметрПол = Новый СписокЗначений;
		ПараметрПол.Добавить(Перечисления.ПолФизическогоЛица.Мужской);
		//Параметр.Добавить(Перечисления.ПолФизическогоЛица.Женский);
		Запрос.УстановитьПараметр("Пол", ПараметрПол);
		
		ЗапросПолМужчины = " 	
		|	И ПроживающиеПоЛССрезПоследних.ФизЛицо.Пол В (&Пол)";
		
		ЗапросПолОбщий = "";
		ЗапросПолЖенщины = "";
		
		Если Военнообязанные Тогда
			ЗапросВоеннообязанные = "
			|	И РАЗНОСТЬДАТ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения, &Момент, ГОД) - ВЫБОР
			|			КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > МЕСЯЦ(&Момент)
			|				ТОГДА 1
			|			КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) = МЕСЯЦ(&Момент)
			|					И ДЕНЬ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > ДЕНЬ(&Момент)
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ Между 15 И 56";
			
			Запрос.УстановитьПараметр("Момент", ТекущаяДата());
		Иначе
			ЗапросВоеннообязанные = "";
		КонецЕсли; 
		
		
	ИначеЕсли Женщины Тогда 
		
		ПараметрПол = Новый СписокЗначений;
		//Параметр.Добавить(Перечисления.ПолФизическогоЛица.Мужской);
		ПараметрПол.Добавить(Перечисления.ПолФизическогоЛица.Женский);
		Запрос.УстановитьПараметр("Пол", ПараметрПол);
		
		ЗапросПолЖенщины = "	
		|	И ПроживающиеПоЛССрезПоследних.ФизЛицо.Пол В (&Пол)";
		
		ЗапросПолМужчины = "";
		ЗапросПолОбщий = "";
		
		Если Военнообязанные Тогда
			ЗапросВоеннообязанные = "
			|	И РАЗНОСТЬДАТ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения, &Момент, ГОД) - ВЫБОР
			|			КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > МЕСЯЦ(&Момент)
			|				ТОГДА 1
			|			КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) = МЕСЯЦ(&Момент)
			|					И ДЕНЬ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > ДЕНЬ(&Момент)
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ Между 15 И 51";
			
			Запрос.УстановитьПараметр("Момент", ТекущаяДата());
		Иначе
			ЗапросВоеннообязанные = "";
		КонецЕсли; 
		
		
	КонецЕсли; 
	
	//Если Военнообязанные Тогда
	//	ЗапросВоеннообязанные = "
	//	|	И 15 < РАЗНОСТЬДАТ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения, &Момент, ГОД) - ВЫБОР
	//	|			КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > МЕСЯЦ(&Момент)
	//	|				ТОГДА 1
	//	|			КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) = МЕСЯЦ(&Момент)
	//	|					И ДЕНЬ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > ДЕНЬ(&Момент)
	//	|				ТОГДА 1
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ < 56";
	//	
	//	Запрос.УстановитьПараметр("Момент", Период.ДатаОкончания);
	//Иначе
	//	ЗапросВоеннообязанные = "";
	//КонецЕсли; 
	
	Если ПоАдресу Тогда
		Если ЗначениеЗаполнено(Квартира) Тогда
			
			ЗапросПоАдресу = "
			|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета = &УлицаЛицевогоСчета
			|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание = &Здание
			|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира = &Квартира";
			
			Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Улица);
			Запрос.УстановитьПараметр("Здание", Дом);
			Запрос.УстановитьПараметр("Квартира", Квартира);
			
		ИначеЕсли ЗначениеЗаполнено(Дом) Тогда 
			
			ЗапросПоАдресу = "
			|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета = &УлицаЛицевогоСчета
			|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание = &Здание";
			
			Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Улица);
			Запрос.УстановитьПараметр("Здание", Дом);
			
		ИначеЕсли ЗначениеЗаполнено(Улица) Тогда 	
			
			ЗапросПоАдресу = "
			|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета = &УлицаЛицевогоСчета";
			
			Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Улица);
			
		Иначе 
			
			ЗапросПоАдресу = "";	
			
		КонецЕсли; 
		
	Иначе 
		ЗапросПоАдресу = "";
	КонецЕсли;
	
	МассивВыбранныхУчастков = Новый Массив;
	Для каждого стр Из Участки Цикл		
		Если стр.ВыполняетсяОтбор Тогда
			МассивВыбранныхУчастков.Добавить(стр.Участок);			
		КонецЕсли; 	
	КонецЦикла; 
	
	Если МассивВыбранныхУчастков.Количество() > 0 Тогда
		ЗапросУчастки = "  
		|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание.Район В(&СписокУчастков)";
		
		Запрос.УстановитьПараметр("СписокУчастков", МассивВыбранныхУчастков);
	Иначе
		ЗапросУчастки = "";
	КонецЕсли; 
	
	//МассивУчастков = ПолучитьМассивУчастков();	
	//Если МассивУчастков.Количество() > 0 Тогда
	//	ЗапросУчастки = "  
	//	|	И ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Здание.Район В(&СписокУчастков)";
	//	
	//	Запрос.УстановитьПараметр("СписокУчастков", МассивУчастков);
	//Иначе
	//	ЗапросУчастки = "";
	//КонецЕсли; 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.Период КАК Период,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ДокументВид,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ДокументСерия,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ДокументНомер,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументПричинаЗамены КАК ДокументПричинаЗамены
	|ПОМЕСТИТЬ вт_ПаспортныеДанные
	|ИЗ
	|	РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|ГДЕ
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид = &ДокументВид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.Период КАК Период,
	|	ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФИО,
	//|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	//|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	ПроживающиеПоЛССрезПоследних.лб_ДатаРегистрацииДляФЛС КАК ДатаРегистрации,
	|	ПроживающиеПоЛССрезПоследних.лб_ДатаВыпискиДляФЛС КАК ДатаСнятияСРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	РАЗНОСТЬДАТ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения, &Момент, ГОД) - ВЫБОР
	|		КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > МЕСЯЦ(&Момент)
	|			ТОГДА 1
	|		КОГДА МЕСЯЦ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) = МЕСЯЦ(&Момент)
	|				И ДЕНЬ(ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения) > ДЕНЬ(&Момент)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Возраст,
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо.Пол КАК ФизЛицоПол,
	|	вт_ПаспортныеДанные.ДокументСерия КАК ДокументСерия,
	|	вт_ПаспортныеДанные.ДокументНомер КАК ДокументНомер,
	|	вт_ПаспортныеДанные.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	|	вт_ПаспортныеДанные.ДокументКемВыдан КАК ДокументКемВыдан,
	|	вт_ПаспортныеДанные.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	вт_ПаспортныеДанные.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства
	|ИЗ
	//|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент) КАК ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ПаспортныеДанные КАК вт_ПаспортныеДанные
	|		ПО ПроживающиеПоЛССрезПоследних.ФизЛицо = вт_ПаспортныеДанные.ФизЛицо
	|ГДЕ
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица В(&СтатусФизЛица)" + ЗапросПолМужчины + ЗапросПолЖенщины + ЗапросПолОбщий + ЗапросДатаРождения + ЗапросВоеннообязанные + ЗапросПоАдресу + ЗапросУчастки + ЗапросДатаРегистрации + 
	"";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Сортировать("ФИО ВОЗР");
	
	//Для снятых с регистрации отдельно проверяем дату, тк дата в регистре - строка
	Если ТипОтчета = "Военнообязанные, снятые с регистрационного учета" Тогда
	КопияТЗ = РезультатЗапроса.Скопировать();
	КопияТЗ.Очистить();
	
	Для каждого стр Из РезультатЗапроса Цикл
		нДатаСнятияСРегистрации = СтрокаВДату(стр.ДатаСнятияСРегистрации);
		
		Если НачалоДня(Период.ДатаНачала) <= нДатаСнятияСРегистрации И нДатаСнятияСРегистрации <= КонецДня(Период.ДатаОкончания) Тогда
			НоваяСтрока = КопияТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
		КонецЕсли;	
			
	КонецЦикла;
	РезультатЗапроса = КопияТЗ;
	КонецЕсли;
	//
		
	Возврат РезультатЗапроса;
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ЗначениеЗаполнено(ТипОтчета) Тогда
		
		
		Если Мужчины ИЛИ Женщины Тогда
			ТабДок = СформироватьНаСервере();
			ТабДок.Показать();
		Иначе 
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
			ПоказатьПредупреждение(Оповещение, "Выбирете пол!",,"Предупреждение");
		КонецЕсли; 
		
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение, "Заполните тип отчета!",,"Предупреждение");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт	
КонецПроцедуры

&НаКлиенте
Процедура Участки_УстановитьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_СнятьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчастки()
	
	Участки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_АдминистративныеОкруга.Ссылка КАК Участок
	|ИЗ
	|	Справочник.бит_АдминистративныеОкруга КАК бит_АдминистративныеОкруга
	|ГДЕ
	|	НЕ бит_АдминистративныеОкруга.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_АдминистративныеОкруга.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаУчастки = Участки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаУчастки, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоАдресуПриИзменении(Элемент)
	
	
	Если ПоАдресу Тогда
		Элементы.ГруппаУточнениеАдреса.Доступность = Истина;	
	Иначе
		Элементы.ГруппаУточнениеАдреса.Доступность = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивУчастков()
	
	МассивУчастков = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Участки.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивУчастков = Участки.Выгрузить(,"Участок").ВыгрузитьКолонку("Участок");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивУчастков.Добавить(НайденнаяСтрока.Участок);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивУчастков;
	
КонецФункции

&НаСервере
Функция СтрокаВДату(Знач Значение)
	
	ПозицияПробела = СтрНайти(Значение, " ", НаправлениеПоиска.СНачала);
	Если ПозицияПробела > 0 Тогда
		Значение = Лев(Значение, ПозицияПробела - 1);
	КонецЕсли;
	Значение = СтрЗаменить(Значение, " ", "");
	Значение = СокрЛП(СтрЗаменить(Значение, ".", ""));
	Значение = СокрЛП(СтрЗаменить(Значение, "/", ""));
	Значение = СокрЛП(СтрЗаменить(Значение, "-", ""));
	Значение = Сред(Значение, 5) + Сред(Значение, 3, 2) + Лев(Значение, 2);
	Если СтрДлина(Значение) = 6 Тогда
		Год = СтрокаВЧисло(Лев(Значение, 2));
		Значение = ?(Год > 29, "19", "20") + Значение;
	КонецЕсли;
	
	ОписаниеТипа = Новый ОписаниеТипов("Дата");
	Результат    = ОписаниеТипа.ПривестиЗначение(Значение);
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция СтрокаВЧисло(Знач Значение)
	Значение  = СтрЗаменить(Значение, " ", "");
	Если СтрНачинаетсяС(Значение, "(") Тогда
		Значение = СтрЗаменить(Значение, "(", "-");
		Значение = СтрЗаменить(Значение, ")", "");
	КонецЕсли;
	
	СтрокаБезНулей = СтрЗаменить(Значение, "0", "");
	Если ПустаяСтрока(СтрокаБезНулей) Или СтрокаБезНулей = "-" Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЧисло  = Новый ОписаниеТипов("Число");
	Результат = ТипЧисло.ПривестиЗначение(Значение);
	
	Возврат ?(Результат <> 0 И Не ПустаяСтрока(СтрокаБезНулей), Результат, Неопределено);
	
КонецФункции
